레이블 파일 읽기 완료: 총 1000개 레이블 검색
데이터셋 중 100.0%를 사용합니다.
----------------------------------------------------------------
        Layer (type)               Output Shape         Param #
================================================================
            Conv2d-1         [-1, 16, 112, 112]             432
       BatchNorm2d-2         [-1, 16, 112, 112]              32
         Hardswish-3         [-1, 16, 112, 112]               0
            Conv2d-4         [-1, 16, 112, 112]             256
       BatchNorm2d-5         [-1, 16, 112, 112]              32
              ReLU-6         [-1, 16, 112, 112]               0
            Conv2d-7           [-1, 16, 56, 56]             144
       BatchNorm2d-8           [-1, 16, 56, 56]              32
 AdaptiveAvgPool2d-9             [-1, 16, 1, 1]               0
          Flatten-10                   [-1, 16]               0
           Linear-11                   [-1, 16]             272
             ReLU-12                   [-1, 16]               0
           Linear-13                   [-1, 16]             272
      Hardsigmoid-14                   [-1, 16]               0
SqueezeExciteModule-15             [-1, 16, 1, 1]               0
           Conv2d-16           [-1, 16, 56, 56]             256
      BatchNorm2d-17           [-1, 16, 56, 56]              32
           Conv2d-18           [-1, 16, 56, 56]             256
       Bottleneck-19           [-1, 16, 56, 56]               0
           Conv2d-20           [-1, 72, 56, 56]           1,152
      BatchNorm2d-21           [-1, 72, 56, 56]             144
             ReLU-22           [-1, 72, 56, 56]               0
           Conv2d-23           [-1, 72, 28, 28]             648
      BatchNorm2d-24           [-1, 72, 28, 28]             144
   IdentityModule-25           [-1, 72, 28, 28]               0
           Conv2d-26           [-1, 24, 28, 28]           1,728
      BatchNorm2d-27           [-1, 24, 28, 28]              48
           Conv2d-28           [-1, 24, 28, 28]             384
       Bottleneck-29           [-1, 24, 28, 28]               0
           Conv2d-30           [-1, 88, 28, 28]           2,112
      BatchNorm2d-31           [-1, 88, 28, 28]             176
             ReLU-32           [-1, 88, 28, 28]               0
           Conv2d-33           [-1, 88, 28, 28]             792
      BatchNorm2d-34           [-1, 88, 28, 28]             176
   IdentityModule-35           [-1, 88, 28, 28]               0
           Conv2d-36           [-1, 24, 28, 28]           2,112
      BatchNorm2d-37           [-1, 24, 28, 28]              48
           Conv2d-38           [-1, 24, 28, 28]             576
       Bottleneck-39           [-1, 24, 28, 28]               0
           Conv2d-40           [-1, 96, 28, 28]           2,304
      BatchNorm2d-41           [-1, 96, 28, 28]             192
        Hardswish-42           [-1, 96, 28, 28]               0
           Conv2d-43           [-1, 96, 14, 14]           2,400
      BatchNorm2d-44           [-1, 96, 14, 14]             192
AdaptiveAvgPool2d-45             [-1, 96, 1, 1]               0
          Flatten-46                   [-1, 96]               0
           Linear-47                   [-1, 96]           9,312
             ReLU-48                   [-1, 96]               0
           Linear-49                   [-1, 96]           9,312
      Hardsigmoid-50                   [-1, 96]               0
SqueezeExciteModule-51             [-1, 96, 1, 1]               0
           Conv2d-52           [-1, 40, 14, 14]           3,840
      BatchNorm2d-53           [-1, 40, 14, 14]              80
           Conv2d-54           [-1, 40, 14, 14]             960
       Bottleneck-55           [-1, 40, 14, 14]               0
           Conv2d-56          [-1, 240, 14, 14]           9,600
      BatchNorm2d-57          [-1, 240, 14, 14]             480
        Hardswish-58          [-1, 240, 14, 14]               0
           Conv2d-59          [-1, 240, 14, 14]           6,000
      BatchNorm2d-60          [-1, 240, 14, 14]             480
AdaptiveAvgPool2d-61            [-1, 240, 1, 1]               0
          Flatten-62                  [-1, 240]               0
           Linear-63                  [-1, 240]          57,840
             ReLU-64                  [-1, 240]               0
           Linear-65                  [-1, 240]          57,840
      Hardsigmoid-66                  [-1, 240]               0
SqueezeExciteModule-67            [-1, 240, 1, 1]               0
           Conv2d-68           [-1, 40, 14, 14]           9,600
      BatchNorm2d-69           [-1, 40, 14, 14]              80
           Conv2d-70           [-1, 40, 14, 14]           1,600
       Bottleneck-71           [-1, 40, 14, 14]               0
           Conv2d-72          [-1, 240, 14, 14]           9,600
      BatchNorm2d-73          [-1, 240, 14, 14]             480
        Hardswish-74          [-1, 240, 14, 14]               0
           Conv2d-75          [-1, 240, 14, 14]           6,000
      BatchNorm2d-76          [-1, 240, 14, 14]             480
AdaptiveAvgPool2d-77            [-1, 240, 1, 1]               0
          Flatten-78                  [-1, 240]               0
           Linear-79                  [-1, 240]          57,840
             ReLU-80                  [-1, 240]               0
           Linear-81                  [-1, 240]          57,840
      Hardsigmoid-82                  [-1, 240]               0
SqueezeExciteModule-83            [-1, 240, 1, 1]               0
           Conv2d-84           [-1, 40, 14, 14]           9,600
      BatchNorm2d-85           [-1, 40, 14, 14]              80
           Conv2d-86           [-1, 40, 14, 14]           1,600
       Bottleneck-87           [-1, 40, 14, 14]               0
           Conv2d-88          [-1, 120, 14, 14]           4,800
      BatchNorm2d-89          [-1, 120, 14, 14]             240
        Hardswish-90          [-1, 120, 14, 14]               0
           Conv2d-91          [-1, 120, 14, 14]           3,000
      BatchNorm2d-92          [-1, 120, 14, 14]             240
AdaptiveAvgPool2d-93            [-1, 120, 1, 1]               0
          Flatten-94                  [-1, 120]               0
           Linear-95                  [-1, 120]          14,520
             ReLU-96                  [-1, 120]               0
           Linear-97                  [-1, 120]          14,520
      Hardsigmoid-98                  [-1, 120]               0
SqueezeExciteModule-99            [-1, 120, 1, 1]               0
          Conv2d-100           [-1, 48, 14, 14]           5,760
     BatchNorm2d-101           [-1, 48, 14, 14]              96
          Conv2d-102           [-1, 48, 14, 14]           1,920
      Bottleneck-103           [-1, 48, 14, 14]               0
          Conv2d-104          [-1, 144, 14, 14]           6,912
     BatchNorm2d-105          [-1, 144, 14, 14]             288
       Hardswish-106          [-1, 144, 14, 14]               0
          Conv2d-107          [-1, 144, 14, 14]           3,600
     BatchNorm2d-108          [-1, 144, 14, 14]             288
AdaptiveAvgPool2d-109            [-1, 144, 1, 1]               0
         Flatten-110                  [-1, 144]               0
          Linear-111                  [-1, 144]          20,880
            ReLU-112                  [-1, 144]               0
          Linear-113                  [-1, 144]          20,880
     Hardsigmoid-114                  [-1, 144]               0
SqueezeExciteModule-115            [-1, 144, 1, 1]               0
          Conv2d-116           [-1, 48, 14, 14]           6,912
     BatchNorm2d-117           [-1, 48, 14, 14]              96
          Conv2d-118           [-1, 48, 14, 14]           2,304
      Bottleneck-119           [-1, 48, 14, 14]               0
          Conv2d-120          [-1, 288, 14, 14]          13,824
     BatchNorm2d-121          [-1, 288, 14, 14]             576
       Hardswish-122          [-1, 288, 14, 14]               0
          Conv2d-123            [-1, 288, 7, 7]           7,200
     BatchNorm2d-124            [-1, 288, 7, 7]             576
AdaptiveAvgPool2d-125            [-1, 288, 1, 1]               0
         Flatten-126                  [-1, 288]               0
          Linear-127                  [-1, 288]          83,232
            ReLU-128                  [-1, 288]               0
          Linear-129                  [-1, 288]          83,232
     Hardsigmoid-130                  [-1, 288]               0
SqueezeExciteModule-131            [-1, 288, 1, 1]               0
          Conv2d-132             [-1, 96, 7, 7]          27,648
     BatchNorm2d-133             [-1, 96, 7, 7]             192
          Conv2d-134             [-1, 96, 7, 7]           4,608
      Bottleneck-135             [-1, 96, 7, 7]               0
          Conv2d-136            [-1, 576, 7, 7]          55,296
     BatchNorm2d-137            [-1, 576, 7, 7]           1,152
       Hardswish-138            [-1, 576, 7, 7]               0
          Conv2d-139            [-1, 576, 7, 7]          14,400
     BatchNorm2d-140            [-1, 576, 7, 7]           1,152
AdaptiveAvgPool2d-141            [-1, 576, 1, 1]               0
         Flatten-142                  [-1, 576]               0
          Linear-143                  [-1, 576]         332,352
            ReLU-144                  [-1, 576]               0
          Linear-145                  [-1, 576]         332,352
     Hardsigmoid-146                  [-1, 576]               0
SqueezeExciteModule-147            [-1, 576, 1, 1]               0
          Conv2d-148             [-1, 96, 7, 7]          55,296
     BatchNorm2d-149             [-1, 96, 7, 7]             192
          Conv2d-150             [-1, 96, 7, 7]           9,216
      Bottleneck-151             [-1, 96, 7, 7]               0
          Conv2d-152            [-1, 576, 7, 7]          55,296
     BatchNorm2d-153            [-1, 576, 7, 7]           1,152
       Hardswish-154            [-1, 576, 7, 7]               0
          Conv2d-155            [-1, 576, 7, 7]          14,400
     BatchNorm2d-156            [-1, 576, 7, 7]           1,152
AdaptiveAvgPool2d-157            [-1, 576, 1, 1]               0
         Flatten-158                  [-1, 576]               0
          Linear-159                  [-1, 576]         332,352
            ReLU-160                  [-1, 576]               0
          Linear-161                  [-1, 576]         332,352
     Hardsigmoid-162                  [-1, 576]               0
SqueezeExciteModule-163            [-1, 576, 1, 1]               0
          Conv2d-164             [-1, 96, 7, 7]          55,296
     BatchNorm2d-165             [-1, 96, 7, 7]             192
          Conv2d-166             [-1, 96, 7, 7]           9,216
      Bottleneck-167             [-1, 96, 7, 7]               0
          Conv2d-168            [-1, 576, 7, 7]          55,296
       Hardswish-169            [-1, 576, 7, 7]               0
     BatchNorm2d-170            [-1, 576, 7, 7]           1,152
AdaptiveAvgPool2d-171            [-1, 576, 1, 1]               0
          Conv2d-172           [-1, 1024, 1, 1]         589,824
       Hardswish-173           [-1, 1024, 1, 1]               0
          Conv2d-174           [-1, 1000, 1, 1]       1,024,000
     MobileNetV3-175                 [-1, 1000]               0
         Dropout-176                 [-1, 1000]               0
          Linear-177                 [-1, 1000]       1,001,000
================================================================
Total params: 4,930,320
Trainable params: 4,930,320
Non-trainable params: 0
----------------------------------------------------------------
Input size (MB): 0.57
Forward/backward pass size (MB): 36.03
Params size (MB): 18.81
Estimated Total Size (MB): 55.41
----------------------------------------------------------------
