INFO: Using Pretrained label list! (not custom one)
레이블 파일 읽기 완료: 총 999개 레이블 검색
데이터셋 중 100.0%를 사용합니다.
----------------------------------------------------------------
        Layer (type)               Output Shape         Param #
================================================================
            Conv2d-1         [-1, 16, 112, 112]             432
       BatchNorm2d-2         [-1, 16, 112, 112]              32
            Hswish-3         [-1, 16, 112, 112]               0
            Conv2d-4         [-1, 16, 112, 112]             256
       BatchNorm2d-5         [-1, 16, 112, 112]              32
              ReLU-6         [-1, 16, 112, 112]               0
            Conv2d-7           [-1, 16, 56, 56]             144
       BatchNorm2d-8           [-1, 16, 56, 56]              32
 AdaptiveAvgPool2d-9             [-1, 16, 1, 1]               0
           Linear-10                    [-1, 4]              64
             ReLU-11                    [-1, 4]               0
           Linear-12                   [-1, 16]              64
         Hsigmoid-13                   [-1, 16]               0
         SEModule-14           [-1, 16, 56, 56]               0
             ReLU-15           [-1, 16, 56, 56]               0
           Conv2d-16           [-1, 16, 56, 56]             256
      BatchNorm2d-17           [-1, 16, 56, 56]              32
 MobileBottleneck-18           [-1, 16, 56, 56]               0
           Conv2d-19           [-1, 72, 56, 56]           1,152
      BatchNorm2d-20           [-1, 72, 56, 56]             144
             ReLU-21           [-1, 72, 56, 56]               0
           Conv2d-22           [-1, 72, 28, 28]             648
      BatchNorm2d-23           [-1, 72, 28, 28]             144
         Identity-24           [-1, 72, 28, 28]               0
             ReLU-25           [-1, 72, 28, 28]               0
           Conv2d-26           [-1, 24, 28, 28]           1,728
      BatchNorm2d-27           [-1, 24, 28, 28]              48
 MobileBottleneck-28           [-1, 24, 28, 28]               0
           Conv2d-29           [-1, 88, 28, 28]           2,112
      BatchNorm2d-30           [-1, 88, 28, 28]             176
             ReLU-31           [-1, 88, 28, 28]               0
           Conv2d-32           [-1, 88, 28, 28]             792
      BatchNorm2d-33           [-1, 88, 28, 28]             176
         Identity-34           [-1, 88, 28, 28]               0
             ReLU-35           [-1, 88, 28, 28]               0
           Conv2d-36           [-1, 24, 28, 28]           2,112
      BatchNorm2d-37           [-1, 24, 28, 28]              48
 MobileBottleneck-38           [-1, 24, 28, 28]               0
           Conv2d-39           [-1, 96, 28, 28]           2,304
      BatchNorm2d-40           [-1, 96, 28, 28]             192
           Hswish-41           [-1, 96, 28, 28]               0
           Conv2d-42           [-1, 96, 14, 14]           2,400
      BatchNorm2d-43           [-1, 96, 14, 14]             192
AdaptiveAvgPool2d-44             [-1, 96, 1, 1]               0
           Linear-45                   [-1, 24]           2,304
             ReLU-46                   [-1, 24]               0
           Linear-47                   [-1, 96]           2,304
         Hsigmoid-48                   [-1, 96]               0
         SEModule-49           [-1, 96, 14, 14]               0
           Hswish-50           [-1, 96, 14, 14]               0
           Conv2d-51           [-1, 40, 14, 14]           3,840
      BatchNorm2d-52           [-1, 40, 14, 14]              80
 MobileBottleneck-53           [-1, 40, 14, 14]               0
           Conv2d-54          [-1, 240, 14, 14]           9,600
      BatchNorm2d-55          [-1, 240, 14, 14]             480
           Hswish-56          [-1, 240, 14, 14]               0
           Conv2d-57          [-1, 240, 14, 14]           6,000
      BatchNorm2d-58          [-1, 240, 14, 14]             480
AdaptiveAvgPool2d-59            [-1, 240, 1, 1]               0
           Linear-60                   [-1, 60]          14,400
             ReLU-61                   [-1, 60]               0
           Linear-62                  [-1, 240]          14,400
         Hsigmoid-63                  [-1, 240]               0
         SEModule-64          [-1, 240, 14, 14]               0
           Hswish-65          [-1, 240, 14, 14]               0
           Conv2d-66           [-1, 40, 14, 14]           9,600
      BatchNorm2d-67           [-1, 40, 14, 14]              80
 MobileBottleneck-68           [-1, 40, 14, 14]               0
           Conv2d-69          [-1, 240, 14, 14]           9,600
      BatchNorm2d-70          [-1, 240, 14, 14]             480
           Hswish-71          [-1, 240, 14, 14]               0
           Conv2d-72          [-1, 240, 14, 14]           6,000
      BatchNorm2d-73          [-1, 240, 14, 14]             480
AdaptiveAvgPool2d-74            [-1, 240, 1, 1]               0
           Linear-75                   [-1, 60]          14,400
             ReLU-76                   [-1, 60]               0
           Linear-77                  [-1, 240]          14,400
         Hsigmoid-78                  [-1, 240]               0
         SEModule-79          [-1, 240, 14, 14]               0
           Hswish-80          [-1, 240, 14, 14]               0
           Conv2d-81           [-1, 40, 14, 14]           9,600
      BatchNorm2d-82           [-1, 40, 14, 14]              80
 MobileBottleneck-83           [-1, 40, 14, 14]               0
           Conv2d-84          [-1, 120, 14, 14]           4,800
      BatchNorm2d-85          [-1, 120, 14, 14]             240
           Hswish-86          [-1, 120, 14, 14]               0
           Conv2d-87          [-1, 120, 14, 14]           3,000
      BatchNorm2d-88          [-1, 120, 14, 14]             240
AdaptiveAvgPool2d-89            [-1, 120, 1, 1]               0
           Linear-90                   [-1, 30]           3,600
             ReLU-91                   [-1, 30]               0
           Linear-92                  [-1, 120]           3,600
         Hsigmoid-93                  [-1, 120]               0
         SEModule-94          [-1, 120, 14, 14]               0
           Hswish-95          [-1, 120, 14, 14]               0
           Conv2d-96           [-1, 48, 14, 14]           5,760
      BatchNorm2d-97           [-1, 48, 14, 14]              96
 MobileBottleneck-98           [-1, 48, 14, 14]               0
           Conv2d-99          [-1, 144, 14, 14]           6,912
     BatchNorm2d-100          [-1, 144, 14, 14]             288
          Hswish-101          [-1, 144, 14, 14]               0
          Conv2d-102          [-1, 144, 14, 14]           3,600
     BatchNorm2d-103          [-1, 144, 14, 14]             288
AdaptiveAvgPool2d-104            [-1, 144, 1, 1]               0
          Linear-105                   [-1, 36]           5,184
            ReLU-106                   [-1, 36]               0
          Linear-107                  [-1, 144]           5,184
        Hsigmoid-108                  [-1, 144]               0
        SEModule-109          [-1, 144, 14, 14]               0
          Hswish-110          [-1, 144, 14, 14]               0
          Conv2d-111           [-1, 48, 14, 14]           6,912
     BatchNorm2d-112           [-1, 48, 14, 14]              96
MobileBottleneck-113           [-1, 48, 14, 14]               0
          Conv2d-114          [-1, 288, 14, 14]          13,824
     BatchNorm2d-115          [-1, 288, 14, 14]             576
          Hswish-116          [-1, 288, 14, 14]               0
          Conv2d-117            [-1, 288, 7, 7]           7,200
     BatchNorm2d-118            [-1, 288, 7, 7]             576
AdaptiveAvgPool2d-119            [-1, 288, 1, 1]               0
          Linear-120                   [-1, 72]          20,736
            ReLU-121                   [-1, 72]               0
          Linear-122                  [-1, 288]          20,736
        Hsigmoid-123                  [-1, 288]               0
        SEModule-124            [-1, 288, 7, 7]               0
          Hswish-125            [-1, 288, 7, 7]               0
          Conv2d-126             [-1, 96, 7, 7]          27,648
     BatchNorm2d-127             [-1, 96, 7, 7]             192
MobileBottleneck-128             [-1, 96, 7, 7]               0
          Conv2d-129            [-1, 576, 7, 7]          55,296
     BatchNorm2d-130            [-1, 576, 7, 7]           1,152
          Hswish-131            [-1, 576, 7, 7]               0
          Conv2d-132            [-1, 576, 7, 7]          14,400
     BatchNorm2d-133            [-1, 576, 7, 7]           1,152
AdaptiveAvgPool2d-134            [-1, 576, 1, 1]               0
          Linear-135                  [-1, 144]          82,944
            ReLU-136                  [-1, 144]               0
          Linear-137                  [-1, 576]          82,944
        Hsigmoid-138                  [-1, 576]               0
        SEModule-139            [-1, 576, 7, 7]               0
          Hswish-140            [-1, 576, 7, 7]               0
          Conv2d-141             [-1, 96, 7, 7]          55,296
     BatchNorm2d-142             [-1, 96, 7, 7]             192
MobileBottleneck-143             [-1, 96, 7, 7]               0
          Conv2d-144            [-1, 576, 7, 7]          55,296
     BatchNorm2d-145            [-1, 576, 7, 7]           1,152
          Hswish-146            [-1, 576, 7, 7]               0
          Conv2d-147            [-1, 576, 7, 7]          14,400
     BatchNorm2d-148            [-1, 576, 7, 7]           1,152
AdaptiveAvgPool2d-149            [-1, 576, 1, 1]               0
          Linear-150                  [-1, 144]          82,944
            ReLU-151                  [-1, 144]               0
          Linear-152                  [-1, 576]          82,944
        Hsigmoid-153                  [-1, 576]               0
        SEModule-154            [-1, 576, 7, 7]               0
          Hswish-155            [-1, 576, 7, 7]               0
          Conv2d-156             [-1, 96, 7, 7]          55,296
     BatchNorm2d-157             [-1, 96, 7, 7]             192
MobileBottleneck-158             [-1, 96, 7, 7]               0
          Conv2d-159            [-1, 576, 7, 7]          55,296
     BatchNorm2d-160            [-1, 576, 7, 7]           1,152
          Hswish-161            [-1, 576, 7, 7]               0
AdaptiveAvgPool2d-162            [-1, 576, 1, 1]               0
          Conv2d-163           [-1, 1280, 1, 1]         738,560
          Hswish-164           [-1, 1280, 1, 1]               0
         Dropout-165                 [-1, 1280]               0
          Linear-166                 [-1, 1000]       1,281,000
================================================================
Total params: 2,938,368
Trainable params: 1,281,000
Non-trainable params: 1,657,368
----------------------------------------------------------------
Input size (MB): 0.57
Forward/backward pass size (MB): 40.17
Params size (MB): 11.21
Estimated Total Size (MB): 51.95
----------------------------------------------------------------
